Revit 2024 API
AnalyticalOpening.PanelId Property
 ElementId of the AnalyticalPanel parent.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ElementId PanelId { get; }
Visual Basic
Public ReadOnly Property PanelId As ElementId
	Get
Visual C++
public:
property ElementId^ PanelId {
	ElementId^ get ();
}
See Also
AnalyticalOpening Class
Autodesk.Revit.DB.Structure Namespace